dylan-luo/NXP_MPC57XX_Demo/mpc5746r_sdk_demo/mpc5746r_sdk_demo_Z4_1/Project_Settings/Startup_Code/startup_MPC5746R.S
;#***************************** Initialise SRAM ECC **************************
;# Store number of 128Byte (32GPRs) segments in Counter
    e_lis       r5, __SRAM_SIZE@h  # Initialize r5 to size of SRAM (Bytes)
    e_or2i      r5, __SRAM_SIZE@l
    e_srwi      r5, r5, 0x7         ;# Divide SRAM size by 128
    mtctr       r5                  ;# Move to counter for use with "bdnz"

;# Base Address of the internal SRAM
    e_lis       r5, __SRAM_BASE_ADDR@h
    e_or2i      r5, __SRAM_BASE_ADDR@l

;# Fill SRAM with writes of 32GPRs
sram_loop:
    e_stmw      r0, 0(r5)           ;# Write all 32 registers to SRAM
    e_addi      r5, r5, 128         ;# Increment the RAM pointer to next 128bytes
    e_bdnz      sram_loop           ;# Loop for all of SRAM

;#************************ Initialise Local Data SRAM ECC *********************
;# Store number of 128Byte (32GPRs) segments in Counter
 e_lis       r5, __LOCAL_DMEM_SIZE@h  ;#Initialize r5 to size of SRAM (Bytes)
 e_or2i      r5, __LOCAL_DMEM_SIZE@l
 e_srwi      r5, r5, 0x7            ;#Divide SRAM size by 128
 mtctr       r5                     ;#Move to counter for use with "bdnz"

;# Base Address of the Local SRAM
 e_lis       r5, __LOCAL_DMEM_BASE_ADDR@h
 e_or2i      r5, __LOCAL_DMEM_BASE_ADDR@l

;# Fill Local SRAM with writes of 32GPRs
ldmem_loop:
    e_stmw      r0,0(r5)             ;# Write all 32 registers to SRAM
    e_addi      r5,r5,128            ;#Increment the RAM pointer to next 128bytes
    e_bdnz      ldmem_loop           ;# Loop for all of SRAM

;#************************ Initialise Local Instruction SRAM ECC *********************
;# Store number of 128Byte (32GPRs) segments in Counter
 e_lis       r5, __LOCAL_IMEM_SIZE@h  ;#Initialize r5 to size of SRAM (Bytes)
 e_or2i      r5, __LOCAL_IMEM_SIZE@l
 e_srwi      r5, r5, 0x7            ;#Divide SRAM size by 128
 mtctr       r5                     ;#Move to counter for use with "bdnz"

;# Base Address of the Local SRAM
 e_lis       r5, __LOCAL_IMEM_BASE_ADDR@h
 e_or2i      r5, __LOCAL_IMEM_BASE_ADDR@l

;# Fill Local SRAM with writes of 32GPRs
limem_loop:
    e_stmw      r0,0(r5)             ;# Write all 32 registers to SRAM
    e_addi      r5,r5,128            ;#Increment the RAM pointer to next 128bytes
    e_bdnz      limem_loop           ;# Loop for all of SRAM

;#********************************* Enable BTB ********************************
;# Flush & Enable BTB - Set BBFI bit in BUCSR
    e_li      r3, 0x201
    mtspr     1013, r3
    se_isync

;#******************** Clear reservations on external interrupt *****************
;# Set ICR in HID0
    e_lis     r3, 0x2
    mtspr     1008, r3
    se_isync

;#*************************** Enable ME Bit in MSR *****************************
    mfmsr    r6
    e_or2i   r6, 0x1000
    mtmsr    r6

#if defined(I_CACHE) && (ICACHE_ENABLE == 1)
;#****************** Invalidate and Enable the Instruction cache **************
__icache_cfg:
    e_li     r5, 0x2
    mtspr    1011, r5

    e_li     r7, 0x4
    e_li     r8, 0x2
    e_lis    r11, 0xFFFF
    e_or2i   r11, 0xFFFB

__icache_inv:
    mfspr    r9, 1011
    and.     r10, r7, r9
    e_beq    __icache_no_abort
    and.     r10, r11, r9
    mtspr    1011, r10
    e_b      __icache_cfg

__icache_no_abort:
    and.     r10, r8, r9
    e_bne    __icache_inv

    mfspr    r5, 1011
    e_ori    r5, r5, 0x0001
    se_isync
    mtspr    1011, r5
#endif

;#****************************** Configure Stack *****************************
    e_lis       r1, __SP_INIT@h         ;# Initialize stack pointer r1 to
    e_or2i      r1, __SP_INIT@l         ;# value in linker command file.

    e_lis       r13, _SDA_BASE_@h       ;# Initialize r13 to sdata base
    e_or2i      r13, _SDA_BASE_@l       ;# (provided by linker).

    e_lis       r2, _SDA2_BASE_@h       ;# Initialize r2 to sdata2 base
    e_or2i      r2, _SDA2_BASE_@l       ;# (provided by linker).

    e_stwu      r0, -64(r1)             ;# Terminate stack.

#ifndef __NO_SYSTEM_INIT
;# Call the system init routine
    e_bl   SystemInit
#endif
;# Init .data and .bss sections
    e_bl   init_data_bss
    wrteei 1    ;# Enable interrupts
;# Call custom init function
;# This symbol must be defined in the ASM preprocessor e.g -DCUSTOM_INIT=my_func, 
;# where my_func is a void function that does not take any parameters and it is defined in the application code
#ifdef CUSTOM_INIT
    e_bl CUSTOM_INIT
#endif

;# Jump to Main
    e_bl        main

    .section .intc_vector_table, "a"
    .align 2
    .globl __isr_vector
__isr_vector:
    .long   SS0_IRQHandler                   /* Vector   0 Software setable flag 0 SSCIR0[CLR0] */
    .long   SS1_IRQHandler                   /* Vector   1 Software setable flag 1 SSCIR0[CLR1] */
    .long   SS2_IRQHandler                   /* Vector   2 Software setable flag 2 SSCIR0[CLR2] */
    .long   SS3_IRQHandler                   /* Vector   3 Software setable flag 3 SSCIR0[CLR3] */
    .long   SS4_IRQHandler                   /* Vector   4 Software setable flag 4 SSCIR0[CLR4] */
    .long   SS5_IRQHandler                   /* Vector   5 Software setable flag 5 SSCIR0[CLR5] */
    .long   SS6_IRQHandler                   /* Vector   6 Software setable flag 6 SSCIR0[CLR6] */
    .long   SS7_IRQHandler                   /* Vector   7 Software setable flag 7 SSCIR0[CLR7] */
    .long   SS8_IRQHandler                   /* Vector   8 Software setable flag 8 SSCIR0[CLR8] */
    .long   SS9_IRQHandler                   /* Vector   9 Software setable flag 9 SSCIR0[CLR9] */
    .long   SS10_IRQHandler                  /* Vector  10 Software setable flag 10 SSCIR0[CLR10] */
    .long   SS11_IRQHandler                  /* Vector  11 Software setable flag 11 SSCIR0[CLR11] */
    .long   SS12_IRQHandler                  /* Vector  12 Software setable flag 12 SSCIR0[CLR12] */
    .long   SS13_IRQHandler                  /* Vector  13 Software setable flag 13 SSCIR0[CLR13] */
    .long   SS14_IRQHandler                  /* Vector  14 Software setable flag 14 SSCIR0[CLR14] */
    .long   SS15_IRQHandler                  /* Vector  15 Software setable flag 15 SSCIR0[CLR15] */
    .long   SS16_IRQHandler                  /* Vector  16 Software setable flag 16 SSCIR0[CLR16] */
    .long   SS17_IRQHandler                  /* Vector  17 Software setable flag 17 SSCIR0[CLR17] */
    .long   SS18_IRQHandler                  /* Vector  18 Software setable flag 18 SSCIR0[CLR18] */
    .long   SS19_IRQHandler                  /* Vector  19 Software setable flag 19 SSCIR0[CLR19] */
    .long   SS20_IRQHandler                  /* Vector  20 Software setable flag 20 SSCIR0[CLR20] */
    .long   SS21_IRQHandler                  /* Vector  21 Software setable flag 21 SSCIR0[CLR21] */
    .long   SS22_IRQHandler                  /* Vector  22 Software setable flag 22 SSCIR0[CLR22] */
    .long   SS23_IRQHandler                  /* Vector  23 Software setable flag 23 SSCIR0[CLR23] */
    .long   SS24_IRQHandler                  /* Vector  24 Software setable flag 24 SSCIR0[CLR24] */
    .long   SS25_IRQHandler                  /* Vector  25 Software setable flag 25 SSCIR0[CLR25] */
    .long   SS26_IRQHandler                  /* Vector  26 Software setable flag 26 SSCIR0[CLR26] */
    .long   SS27_IRQHandler                  /* Vector  27 Software setable flag 27 SSCIR0[CLR27] */
    .long   SS28_IRQHandler                  /* Vector  28 Software setable flag 28 SSCIR0[CLR28] */
    .long   SS29_IRQHandler                  /* Vector  29 Software setable flag 29 SSCIR0[CLR29] */
    .long   SS30_IRQHandler                  /* Vector  30 Software setable flag 30 SSCIR0[CLR30] */
    .long   SS31_IRQHandler                  /* Vector  31 Software setable flag 31 SSCIR0[CLR31] */
    .long   SWT0_IRQHandler                  /* Vector  32 Platform watchdog timer 0 SWT_0_IR[TIF] */
    .long   SWT1_IRQHandler                  /* Vector  33 Platform watchdog timer 1 SWT_1_IR[TIF] */
    .long   DefaultISR                       /* Vector  34 */
    .long   SWT3_IRQHandler                  /* Vector  35 Platform watchdog timer 3 SWT_3_IR[TIF] */
    .long   STM0_CIR0_IRQHandler             /* Vector  36 Platform periodic timer 0_0 (STM) STM_0_CIR0[CIF] */
    .long   STM0_CIR1_IRQHandler             /* Vector  37 Platform periodic timer 0_1 (STM) STM_0_CIR1[CIF] */
    .long   STM0_CIR2_IRQHandler             /* Vector  38 Platform periodic timer 0_2 (STM) STM_0_CIR2[CIF] */
    .long   STM0_CIR3_IRQHandler             /* Vector  39 Platform periodic timer 0_3 (STM) STM_0_CIR3[CIF] */
    .long   STM1_CIR0_IRQHandler             /* Vector  40 Platform periodic timer 1_0 (STM) STM_1_CIR0[CIF] */
    .long   STM1_CIR1_IRQHandler             /* Vector  41 Platform periodic timer 1_1 (STM) STM_1_CIR1[CIF] */
    .long   STM1_CIR2_IRQHandler             /* Vector  42 Platform periodic timer 1_2 (STM) STM_1_CIR2[CIF] */
    .long   STM1_CIR3_IRQHandler             /* Vector  43 Platform periodic timer 1_3 (STM) STM_1_CIR3[CIF] */
    .long   DefaultISR                       /* Vector  44 */
    .long   DefaultISR                       /* Vector  45 */
    .long   DefaultISR                       /* Vector  46 */
    .long   DefaultISR                       /* Vector  47 */
    .long   DefaultISR                       /* Vector  48 */
    .long   DefaultISR                       /* Vector  49 */
    .long   DefaultISR                       /* Vector  50 */
    .long   DefaultISR                       /* Vector  51 */
    .long   DMA0_Ch0_Ch63_Error_IRQHandler   /* Vector  52 eDMA0 Combined Error 0-63 */
    .long   DMA0_Ch0_IRQHandler              /* Vector  53 eDMA0 Channel 0 */
    .long   DMA0_Ch1_IRQHandler              /* Vector  54 eDMA0 Channel 1 */
    .long   DMA0_Ch2_IRQHandler              /* Vector  55 eDMA0 Channel 2 */
    .long   DMA0_Ch3_IRQHandler              /* Vector  56 eDMA0 Channel 3 */
    .long   DMA0_Ch4_IRQHandler              /* Vector  57 eDMA0 Channel 4 */
    .long   DMA0_Ch5_IRQHandler              /* Vector  58 eDMA0 Channel 5 */
    .long   DMA0_Ch6_IRQHandler              /* Vector  59 eDMA0 Channel 6 */
    .long   DMA0_Ch7_IRQHandler              /* Vector  60 eDMA0 Channel 7 */
    .long   DMA0_Ch8_IRQHandler              /* Vector  61 eDMA0 Channel 8 */
    .long   DMA0_Ch9_IRQHandler              /* Vector  62 eDMA0 Channel 9 */
    .long   DMA0_Ch10_IRQHandler             /* Vector  63 eDMA0 Channel 10 */
    .long   DMA0_Ch11_IRQHandler             /* Vector  64 eDMA0 Channel 11 */
    .long   DMA0_Ch12_IRQHandler             /* Vector  65 eDMA0 Channel 12 */
    .long   DMA0_Ch13_IRQHandler             /* Vector  66 eDMA0 Channel 13 */
    .long   DMA0_Ch14_IRQHandler             /* Vector  67 eDMA0 Channel 14 */
    .long   DMA0_Ch15_IRQHandler             /* Vector  68 eDMA0 Channel 15 */
    .long   DMA0_Ch16_IRQHandler             /* Vector  69 eDMA0 Channel 16 */
    .long   DMA0_Ch17_IRQHandler             /* Vector  70 eDMA0 Channel 17 */
    .long   DMA0_Ch18_IRQHandler             /* Vector  71 eDMA0 Channel 18 */
    .long   DMA0_Ch19_IRQHandler             /* Vector  72 eDMA0 Channel 19 */
    .long   DMA0_Ch20_IRQHandler             /* Vector  73 eDMA0 Channel 20 */
    .long   DMA0_Ch21_IRQHandler             /* Vector  74 eDMA0 Channel 21 */
    .long   DMA0_Ch22_IRQHandler             /* Vector  75 eDMA0 Channel 22 */
    .long   DMA0_Ch23_IRQHandler             /* Vector  76 eDMA0 Channel 23 */
    .long   DMA0_Ch24_IRQHandler             /* Vector  77 eDMA0 Channel 24 */
    .long   DMA0_Ch25_IRQHandler             /* Vector  78 eDMA0 Channel 25 */
    .long   DMA0_Ch26_IRQHandler             /* Vector  79 eDMA0 Channel 26 */
    .long   DMA0_Ch27_IRQHandler             /* Vector  80 eDMA0 Channel 27 */
    .long   DMA0_Ch28_IRQHandler             /* Vector  81 eDMA0 Channel 28 */
    .long   DMA0_Ch29_IRQHandler             /* Vector  82 eDMA0 Channel 29 */
    .long   DMA0_Ch30_IRQHandler             /* Vector  83 eDMA0 Channel 30 */
    .long   DMA0_Ch31_IRQHandler             /* Vector  84 eDMA0 Channel 31 */
    .long   DMA0_Ch32_IRQHandler             /* Vector  85 eDMA0 Channel 32 */
    .long   DMA0_Ch33_IRQHandler             /* Vector  86 eDMA0 Channel 33 */
    .long   DMA0_Ch34_IRQHandler             /* Vector  87 eDMA0 Channel 34 */
    .long   DMA0_Ch35_IRQHandler             /* Vector  88 eDMA0 Channel 35 */
    .long   DMA0_Ch36_IRQHandler             /* Vector  89 eDMA0 Channel 36 */
    .long   DMA0_Ch37_IRQHandler             /* Vector  90 eDMA0 Channel 37 */
    .long   DMA0_Ch38_IRQHandler             /* Vector  91 eDMA0 Channel 38 */
    .long   DMA0_Ch39_IRQHandler             /* Vector  92 eDMA0 Channel 39 */
    .long   DMA0_Ch40_IRQHandler             /* Vector  93 eDMA0 Channel 40 */
    .long   DMA0_Ch41_IRQHandler             /* Vector  94 eDMA0 Channel 41 */
    .long   DMA0_Ch42_IRQHandler             /* Vector  95 eDMA0 Channel 42 */
    .long   DMA0_Ch43_IRQHandler             /* Vector  96 eDMA0 Channel 43 */
    .long   DMA0_Ch44_IRQHandler             /* Vector  97 eDMA0 Channel 44 */
    .long   DMA0_Ch45_IRQHandler             /* Vector  98 eDMA0 Channel 45 */
    .long   DMA0_Ch46_IRQHandler             /* Vector  99 eDMA0 Channel 46 */
    .long   DMA0_Ch47_IRQHandler             /* Vector 100 eDMA0 Channel 47 */
    .long   DMA0_Ch48_IRQHandler             /* Vector 101 eDMA0 Channel 48 */
    .long   DMA0_Ch49_IRQHandler             /* Vector 102 eDMA0 Channel 49 */
    .long   DMA0_Ch50_IRQHandler             /* Vector 103 eDMA0 Channel 50 */
    .long   DMA0_Ch51_IRQHandler             /* Vector 104 eDMA0 Channel 51 */
    .long   DMA0_Ch52_IRQHandler             /* Vector 105 eDMA0 Channel 52 */
    .long   DMA0_Ch53_IRQHandler             /* Vector 106 eDMA0 Channel 53 */
    .long   DMA0_Ch54_IRQHandler             /* Vector 107 eDMA0 Channel 54 */
    .long   DMA0_Ch55_IRQHandler             /* Vector 108 eDMA0 Channel 55 */
    .long   DMA0_Ch56_IRQHandler             /* Vector 109 eDMA0 Channel 56 */
    .long   DMA0_Ch57_IRQHandler             /* Vector 110 eDMA0 Channel 57 */
    .long   DMA0_Ch58_IRQHandler             /* Vector 111 eDMA0 Channel 58 */
    .long   DMA0_Ch59_IRQHandler             /* Vector 112 eDMA0 Channel 59 */
    .long   DMA0_Ch60_IRQHandler             /* Vector 113 eDMA0 Channel 60 */
    .long   DMA0_Ch61_IRQHandler             /* Vector 114 eDMA0 Channel 61 */
    .long   DMA0_Ch62_IRQHandler             /* Vector 115 eDMA0 Channel 62 */
    .long   DMA0_Ch63_IRQHandler             /* Vector 116 eDMA0 Channel 63 */
    .long   DefaultISR                       /* Vector 117 */
    .long   DefaultISR                       /* Vector 118 */
    .long   DefaultISR                       /* Vector 119 */
    .long   DefaultISR                       /* Vector 120 */
    .long   DefaultISR                       /* Vector 121 */
    .long   DefaultISR                       /* Vector 122 */
    .long   DefaultISR                       /* Vector 123 */
    .long   DefaultISR                       /* Vector 124 */
    .long   DefaultISR                       /* Vector 125 */
    .long   DefaultISR                       /* Vector 126 */
    .long   DefaultISR                       /* Vector 127 */
    .long   DefaultISR                       /* Vector 128 */
    .long   DefaultISR                       /* Vector 129 */
    .long   DefaultISR                       /* Vector 130 */
    .long   DefaultISR                       /* Vector 131 */
    .long   DefaultISR                       /* Vector 132 */
    .long   DefaultISR                       /* Vector 133 */
    .long   DefaultISR                       /* Vector 134 */
    .long   DefaultISR                       /* Vector 135 */
    .long   DefaultISR                       /* Vector 136 */
    .long   DefaultISR                       /* Vector 137 */
    .long   DefaultISR                       /* Vector 138 */
    .long   DefaultISR                       /* Vector 139 */
    .long   DefaultISR                       /* Vector 140 */
    .long   DefaultISR                       /* Vector 141 */
    .long   DefaultISR                       /* Vector 142 */
    .long   DefaultISR                       /* Vector 143 */
    .long   DefaultISR                       /* Vector 144 */
    .long   DefaultISR                       /* Vector 145 */
    .long   DefaultISR                       /* Vector 146 */
    .long   DefaultISR                       /* Vector 147 */
    .long   DefaultISR                       /* Vector 148 */
    .long   DefaultISR                       /* Vector 149 */
    .long   DefaultISR                       /* Vector 150 */
    .long   DefaultISR                       /* Vector 151 */
    .long   DefaultISR                       /* Vector 152 */
    .long   DefaultISR                       /* Vector 153 */
    .long   DefaultISR                       /* Vector 154 */
    .long   DefaultISR                       /* Vector 155 */
    .long   DefaultISR                       /* Vector 156 */
    .long   DefaultISR                       /* Vector 157 */
    .long   DefaultISR                       /* Vector 158 */
    .long   DefaultISR                       /* Vector 159 */
    .long   DefaultISR                       /* Vector 160 */
    .long   DefaultISR                       /* Vector 161 */
    .long   DefaultISR                       /* Vector 162 */
    .long   DefaultISR                       /* Vector 163 */
    .long   DefaultISR                       /* Vector 164 */
    .long   DefaultISR                       /* Vector 165 */
    .long   DefaultISR                       /* Vector 166 */
    .long   DefaultISR                       /* Vector 167 */
    .long   DefaultISR                       /* Vector 168 */
    .long   DefaultISR                       /* Vector 169 */
    .long   DefaultISR                       /* Vector 170 */
    .long   DefaultISR                       /* Vector 171 */
    .long   DefaultISR                       /* Vector 172 */
    .long   DefaultISR                       /* Vector 173 */
    .long   DefaultISR                       /* Vector 174 */
    .long   DefaultISR                       /* Vector 175 */
    .long   DefaultISR                       /* Vector 176 */
    .long   DefaultISR                       /* Vector 177 */
    .long   DefaultISR                       /* Vector 178 */
    .long   DefaultISR                       /* Vector 179 */
    .long   DefaultISR                       /* Vector 180 */
    .long   DefaultISR                       /* Vector 181 */
    .long   DefaultISR                       /* Vector 182 */
    .long   DefaultISR                       /* Vector 183 */
    .long   DefaultISR                       /* Vector 184 */
    .long   FMC_Done_IRQHandler              /* Vector 185 Flash controller Prog/Erase/Suspend IRQ_0 MCR[DONE] */
    .long   DefaultISR                       /* Vector 186 */
    .long   DefaultISR                       /* Vector 187 */
    .long   DefaultISR                       /* Vector 188 */
    .long   DefaultISR                       /* Vector 189 */
    .long   DefaultISR                       /* Vector 190 */
    .long   DefaultISR                       /* Vector 191 */
    .long   DefaultISR                       /* Vector 192 */
    .long   DefaultISR                       /* Vector 193 */
    .long   DefaultISR                       /* Vector 194 */
    .long   DefaultISR                       /* Vector 195 */
    .long   DefaultISR                       /* Vector 196 */
    .long   DefaultISR                       /* Vector 197 */
    .long   DefaultISR                       /* Vector 198 */
    .long   DefaultISR                       /* Vector 199 */
    .long   DefaultISR                       /* Vector 200 */
    .long   DefaultISR                       /* Vector 201 */
    .long   DefaultISR                       /* Vector 202 */
    .long   DefaultISR                       /* Vector 203 */
    .long   DefaultISR                       /* Vector 204 */
    .long   DefaultISR                       /* Vector 205 */
    .long   DefaultISR                       /* Vector 206 */
    .long   DefaultISR                       /* Vector 207 */
    .long   DefaultISR                       /* Vector 208 */
    .long   DefaultISR                       /* Vector 209 */
    .long   DefaultISR                       /* Vector 210 */
    .long   DefaultISR                       /* Vector 211 */
    .long   DefaultISR                       /* Vector 212 */
    .long   DefaultISR                       /* Vector 213 */
    .long   DefaultISR                       /* Vector 214 */
    .long   DefaultISR                       /* Vector 215 */
    .long   DefaultISR                       /* Vector 216 */
    .long   DefaultISR                       /* Vector 217 */
    .long   FEC_TXF_IRQHandler               /* Vector 218 Ethernet_0_0 EIR[TXF] */
    .long   FEC_RXF_IRQHandler               /* Vector 219 Ethernet_0_0 EIR[RXF] */
    .long   FEC_ERR_IRQHandler               /* Vector 220 Ethernet_0_0 EIR[ERRORS] */
    .long   DefaultISR                       /* Vector 221 */
    .long   DefaultISR                       /* Vector 222 */
    .long   DefaultISR                       /* Vector 223 */
    .long   DefaultISR                       /* Vector 224 */
    .long   DefaultISR                       /* Vector 225 */
    .long   PIT0_TFLG0_IRQHandler            /* Vector 226 Periodic Interrupt Timer (PIT0) PIT_0_TFLG[TIF] */
    .long   PIT0_TFLG1_IRQHandler            /* Vector 227 Periodic Interrupt Timer (PIT1) PIT_0_TFLG[TIF] */
    .long   PIT0_TFLG2_IRQHandler            /* Vector 228 Periodic Interrupt Timer (PIT2) PIT_0_TFLG[TIF] */
    .long   PIT0_TFLG3_IRQHandler            /* Vector 229 Periodic Interrupt Timer (PIT3) PIT_0_TFLG[TIF] */
    .long   PIT0_TFLG4_IRQHandler            /* Vector 230 Periodic Interrupt Timer (PIT4) PIT_0_TFLG[TIF] */
    .long   PIT0_TFLG5_IRQHandler            /* Vector 231 Periodic Interrupt Timer (PIT5) PIT_0_TFLG[TIF] */
    .long   PIT0_TFLG6_IRQHandler            /* Vector 232 Periodic Interrupt Timer (PIT6) PIT_0_TFLG[TIF] */
    .long   PIT0_TFLG7_IRQHandler            /* Vector 233 Periodic Interrupt Timer (PIT7) PIT_0_TFLG[TIF] */
    .long   DefaultISR                       /* Vector 234 */
    .long   DefaultISR                       /* Vector 235 */
    .long   DefaultISR                       /* Vector 236 */
    .long   DefaultISR                       /* Vector 237 */
    .long   DefaultISR                       /* Vector 238 */
    .long   PIT0_RTI_IRQHandler              /* Vector 239 PIT_RTI PIT_0_RTI_TFLG[TIF] */
    .long   PIT1_TFLG0_IRQHandler            /* Vector 240 PIT_64_Lower PIT_1_TFLG0[TIF] */
    .long   PIT1_TFLG1_IRQHandler            /* Vector 241 PIT_64_Upper PIT_1_TFLG1[TIF] */
    .long   XOSC_IRQHandler                  /* Vector 242 XOSC Counter */
    .long   SIU_0_IRQHandler                 /* Vector 243 SIU External Interrupt_0 */
    .long   SIU_1_IRQHandler                 /* Vector 244 SIU External Interrupt_1 */
    .long   DefaultISR                       /* Vector 245 */
    .long   DefaultISR                       /* Vector 246 */
    .long   DefaultISR                       /* Vector 247 */
    .long   DefaultISR                       /* Vector 248 */
    .long   DefaultISR                       /* Vector 249 */
    .long   DefaultISR                       /* Vector 250 */
    .long   MC_ME_SAFE_IRQHandler            /* Vector 251 ME_IS[I_SAFE] */
    .long   MC_ME_MTC_IRQHandler             /* Vector 252 ME_IS[I_MTC] */
    .long   MC_ME_IMODE_IRQHandler           /* Vector 253 ME_IS[I_IMODE] */
    .long   MC_ME_ICONF_IRQHandler           /* Vector 254 ME_IS[I_ICONF] */
