dylan-luo/NXP_MPC57XX_Demo/mpc5746r_sdk_demo/mpc5746r_sdk_demo_Z4_1/Project_Settings/Startup_Code/startup_MPC5746R.S
    .long   BCTU0_ADC2_IRQHandler            /* Vector 903 BCTU_0_ADC2 */
    .long   BCTU0_ADC3_IRQHandler            /* Vector 904 BCTU_0_ADC3 */
    .long   BCTU0_LIST_IRQHandler            /* Vector 905 BCTU_0_LIST */
    .long   DefaultISR                       /* Vector 906 */
    .long   DefaultISR                       /* Vector 907 */
    .long   DefaultISR                       /* Vector 908 */
    .long   DefaultISR                       /* Vector 909 */
    .long   DefaultISR                       /* Vector 910 */
    .long   DefaultISR                       /* Vector 911 */
    .long   DefaultISR                       /* Vector 912 */
    .long   DefaultISR                       /* Vector 913 */
    .long   DefaultISR                       /* Vector 914 */
    .long   REACM_G_IRQHandler               /* Vector 915 ipi_int_reacm */
    .long   REACM_CH0_IRQHandler             /* Vector 916 ipi_int_reacm_ch0 */
    .long   REACM_CH1_IRQHandler             /* Vector 917 ipi_int_reacm_ch1 */
    .long   REACM_CH2_IRQHandler             /* Vector 918 ipi_int_reacm_ch2 */
    .long   REACM_CH3_IRQHandler             /* Vector 919 ipi_int_reacm_ch3 */
    .long   REACM_CH4_IRQHandler             /* Vector 920 ipi_int_reacm_ch4 */
    .long   REACM_CH5_IRQHandler             /* Vector 921 ipi_int_reacm_ch5 */
    .long   REACM_CH6_IRQHandler             /* Vector 922 ipi_int_reacm_ch6 */
    .long   REACM_CH7_IRQHandler             /* Vector 923 ipi_int_reacm_ch7 */
    .long   REACM_CH8_IRQHandler             /* Vector 924 ipi_int_reacm_ch8 */
    .long   REACM_CH9_IRQHandler             /* Vector 925 ipi_int_reacm_ch9 */
    .long   DefaultISR                       /* Vector 926 */
    .long   DefaultISR                       /* Vector 927 */
    .long   DefaultISR                       /* Vector 928 */
    .long   DefaultISR                       /* Vector 929 */
    .long   DefaultISR                       /* Vector 930 */
    .long   DefaultISR                       /* Vector 931 */
    .long   DECFILTER0_IN_IRQHandler         /* Vector 932 ipi_int_dec_filter_0_in */
    .long   DECFILTER0_OUT_IRQHandler        /* Vector 933 pi_int_dec_filter_0_out */
    .long   DECFILTER0_ERR_IRQHandler        /* Vector 934 ipi_int_dec_filter_0_err */
    .long   DECFILTER1_IN_IRQHandler         /* Vector 935 ipi_int_dec_filter_1_in */
    .long   DECFILTER1_OUT_IRQHandler        /* Vector 936 ipi_int_dec_filter_1_out */
    .long   DECFILTER1_ERR_IRQHandler        /* Vector 937 ipi_int_dec_filter_1_err */

    .align  2
    .weak DefaultISR
    .type DefaultISR, %function
DefaultISR:
    e_b       DefaultISR
    .size DefaultISR, . - DefaultISR

/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
    .macro def_irq_handler  handler_name
    .weak \handler_name
    .set  \handler_name, DefaultISR
    .endm

/* Exception Handlers */
    def_irq_handler    IVOR0_Handler
    def_irq_handler    IVOR1_Handler
    def_irq_handler    IVOR2_Handler
    def_irq_handler    IVOR3_Handler
    def_irq_handler    IVOR4_Handler
    def_irq_handler    IVOR5_Handler
    def_irq_handler    IVOR6_Handler
    def_irq_handler    IVOR8_Handler
    def_irq_handler    IVOR15_Handler
    def_irq_handler    IVOR33_Handler
    def_irq_handler    IVOR34_Handler
    def_irq_handler    IVOR35_Handler
    def_irq_handler    IVOR0_Exception_Handler
    def_irq_handler    IVOR1_Exception_Handler
    def_irq_handler    IVOR2_Exception_Handler
    def_irq_handler    IVOR3_Exception_Handler
    def_irq_handler    IVOR5_Exception_Handler
    def_irq_handler    IVOR6_Exception_Handler
    def_irq_handler    IVOR8_Exception_Handler
    def_irq_handler    IVOR15_Exception_Handler
    def_irq_handler    IVOR33_Exception_Handler
    def_irq_handler    IVOR34_Exception_Handler
    def_irq_handler    IVOR35_Exception_Handler
    def_irq_handler    SS0_IRQHandler
    def_irq_handler    SS1_IRQHandler
    def_irq_handler    SS2_IRQHandler
    def_irq_handler    SS3_IRQHandler
    def_irq_handler    SS4_IRQHandler
    def_irq_handler    SS5_IRQHandler
    def_irq_handler    SS6_IRQHandler
    def_irq_handler    SS7_IRQHandler
    def_irq_handler    SS8_IRQHandler
    def_irq_handler    SS9_IRQHandler
    def_irq_handler    SS10_IRQHandler
    def_irq_handler    SS11_IRQHandler
    def_irq_handler    SS12_IRQHandler
    def_irq_handler    SS13_IRQHandler
    def_irq_handler    SS14_IRQHandler
    def_irq_handler    SS15_IRQHandler
    def_irq_handler    SS16_IRQHandler
    def_irq_handler    SS17_IRQHandler
    def_irq_handler    SS18_IRQHandler
    def_irq_handler    SS19_IRQHandler
    def_irq_handler    SS20_IRQHandler
    def_irq_handler    SS21_IRQHandler
    def_irq_handler    SS22_IRQHandler
    def_irq_handler    SS23_IRQHandler
    def_irq_handler    SS24_IRQHandler
    def_irq_handler    SS25_IRQHandler
    def_irq_handler    SS26_IRQHandler
    def_irq_handler    SS27_IRQHandler
    def_irq_handler    SS28_IRQHandler
    def_irq_handler    SS29_IRQHandler
    def_irq_handler    SS30_IRQHandler
    def_irq_handler    SS31_IRQHandler
    def_irq_handler    SWT0_IRQHandler
    def_irq_handler    SWT1_IRQHandler
    def_irq_handler    SWT3_IRQHandler
    def_irq_handler    STM0_CIR0_IRQHandler
    def_irq_handler    STM0_CIR1_IRQHandler
    def_irq_handler    STM0_CIR2_IRQHandler
    def_irq_handler    STM0_CIR3_IRQHandler
    def_irq_handler    STM1_CIR0_IRQHandler
    def_irq_handler    STM1_CIR1_IRQHandler
    def_irq_handler    STM1_CIR2_IRQHandler
    def_irq_handler    STM1_CIR3_IRQHandler
    def_irq_handler    DMA0_Ch0_Ch63_Error_IRQHandler
    def_irq_handler    DMA0_Ch0_IRQHandler
    def_irq_handler    DMA0_Ch1_IRQHandler
    def_irq_handler    DMA0_Ch2_IRQHandler
    def_irq_handler    DMA0_Ch3_IRQHandler
    def_irq_handler    DMA0_Ch4_IRQHandler
    def_irq_handler    DMA0_Ch5_IRQHandler
    def_irq_handler    DMA0_Ch6_IRQHandler
    def_irq_handler    DMA0_Ch7_IRQHandler
    def_irq_handler    DMA0_Ch8_IRQHandler
    def_irq_handler    DMA0_Ch9_IRQHandler
    def_irq_handler    DMA0_Ch10_IRQHandler
    def_irq_handler    DMA0_Ch11_IRQHandler
    def_irq_handler    DMA0_Ch12_IRQHandler
    def_irq_handler    DMA0_Ch13_IRQHandler
    def_irq_handler    DMA0_Ch14_IRQHandler
    def_irq_handler    DMA0_Ch15_IRQHandler
    def_irq_handler    DMA0_Ch16_IRQHandler
    def_irq_handler    DMA0_Ch17_IRQHandler
    def_irq_handler    DMA0_Ch18_IRQHandler
    def_irq_handler    DMA0_Ch19_IRQHandler
    def_irq_handler    DMA0_Ch20_IRQHandler
    def_irq_handler    DMA0_Ch21_IRQHandler
    def_irq_handler    DMA0_Ch22_IRQHandler
    def_irq_handler    DMA0_Ch23_IRQHandler
    def_irq_handler    DMA0_Ch24_IRQHandler
    def_irq_handler    DMA0_Ch25_IRQHandler
    def_irq_handler    DMA0_Ch26_IRQHandler
    def_irq_handler    DMA0_Ch27_IRQHandler
    def_irq_handler    DMA0_Ch28_IRQHandler
    def_irq_handler    DMA0_Ch29_IRQHandler
    def_irq_handler    DMA0_Ch30_IRQHandler
    def_irq_handler    DMA0_Ch31_IRQHandler
    def_irq_handler    DMA0_Ch32_IRQHandler
    def_irq_handler    DMA0_Ch33_IRQHandler
    def_irq_handler    DMA0_Ch34_IRQHandler
    def_irq_handler    DMA0_Ch35_IRQHandler
    def_irq_handler    DMA0_Ch36_IRQHandler
    def_irq_handler    DMA0_Ch37_IRQHandler
    def_irq_handler    DMA0_Ch38_IRQHandler
    def_irq_handler    DMA0_Ch39_IRQHandler
    def_irq_handler    DMA0_Ch40_IRQHandler
    def_irq_handler    DMA0_Ch41_IRQHandler
    def_irq_handler    DMA0_Ch42_IRQHandler
    def_irq_handler    DMA0_Ch43_IRQHandler
    def_irq_handler    DMA0_Ch44_IRQHandler
    def_irq_handler    DMA0_Ch45_IRQHandler
    def_irq_handler    DMA0_Ch46_IRQHandler
    def_irq_handler    DMA0_Ch47_IRQHandler
    def_irq_handler    DMA0_Ch48_IRQHandler
    def_irq_handler    DMA0_Ch49_IRQHandler
    def_irq_handler    DMA0_Ch50_IRQHandler
    def_irq_handler    DMA0_Ch51_IRQHandler
    def_irq_handler    DMA0_Ch52_IRQHandler
    def_irq_handler    DMA0_Ch53_IRQHandler
    def_irq_handler    DMA0_Ch54_IRQHandler
    def_irq_handler    DMA0_Ch55_IRQHandler
    def_irq_handler    DMA0_Ch56_IRQHandler
    def_irq_handler    DMA0_Ch57_IRQHandler
    def_irq_handler    DMA0_Ch58_IRQHandler
    def_irq_handler    DMA0_Ch59_IRQHandler
    def_irq_handler    DMA0_Ch60_IRQHandler
    def_irq_handler    DMA0_Ch61_IRQHandler
    def_irq_handler    DMA0_Ch62_IRQHandler
    def_irq_handler    DMA0_Ch63_IRQHandler
    def_irq_handler    FMC_Done_IRQHandler
    def_irq_handler    FEC_TXF_IRQHandler
    def_irq_handler    FEC_RXF_IRQHandler
    def_irq_handler    FEC_ERR_IRQHandler
    def_irq_handler    PIT0_TFLG0_IRQHandler
    def_irq_handler    PIT0_TFLG1_IRQHandler
    def_irq_handler    PIT0_TFLG2_IRQHandler
    def_irq_handler    PIT0_TFLG3_IRQHandler
    def_irq_handler    PIT0_TFLG4_IRQHandler
    def_irq_handler    PIT0_TFLG5_IRQHandler
    def_irq_handler    PIT0_TFLG6_IRQHandler
    def_irq_handler    PIT0_TFLG7_IRQHandler
    def_irq_handler    PIT0_RTI_IRQHandler
    def_irq_handler    PIT1_TFLG0_IRQHandler
    def_irq_handler    PIT1_TFLG1_IRQHandler
    def_irq_handler    XOSC_IRQHandler
    def_irq_handler    SIU_0_IRQHandler
    def_irq_handler    SIU_1_IRQHandler
    def_irq_handler    MC_ME_SAFE_IRQHandler
    def_irq_handler    MC_ME_MTC_IRQHandler
    def_irq_handler    MC_ME_IMODE_IRQHandler
    def_irq_handler    MC_ME_ICONF_IRQHandler
    def_irq_handler    MC_ME_RGM_IRQHandler
    def_irq_handler    DSPI0_FIFO_Error_IRQHandler
    def_irq_handler    DSPI0_EOQF_IRQHandler
    def_irq_handler    DSPI0_Send_IRQHandler
    def_irq_handler    DSPI0_TCF_IRQHandler
    def_irq_handler    DSPI0_Receive_IRQHandler
    def_irq_handler    DSPI0_CMDTCF_IRQHandler
    def_irq_handler    DSPI0_CMDFFF_IRQHandler
    def_irq_handler    DSPI0_SPEF_IRQHandler
    def_irq_handler    DSPI1_FIFO_Error_IRQHandler
    def_irq_handler    DSPI1_EOQF_IRQHandler
    def_irq_handler    DSPI1_Send_IRQHandler
    def_irq_handler    DSPI1_TCF_IRQHandler
    def_irq_handler    DSPI1_Receive_IRQHandler
    def_irq_handler    DSPI1_CMDTCF_IRQHandler
    def_irq_handler    DSPI1_CMDFFF_IRQHandler
    def_irq_handler    DSPI1_SPEF_IRQHandler
    def_irq_handler    DSPI2_FIFO_Error_IRQHandler
    def_irq_handler    DSPI2_EOQF_IRQHandler
    def_irq_handler    DSPI2_Send_IRQHandler
    def_irq_handler    DSPI2_TCF_IRQHandler
    def_irq_handler    DSPI2_Receive_IRQHandler
    def_irq_handler    DSPI2_CMDTCF_IRQHandler
    def_irq_handler    DSPI2_CMDFFF_IRQHandler
    def_irq_handler    DSPI2_SPEF_IRQHandler
    def_irq_handler    DSPI3_FIFO_Error_IRQHandler
    def_irq_handler    DSPI3_EOQF_IRQHandler
    def_irq_handler    DSPI3_Send_IRQHandler
    def_irq_handler    DSPI3_TCF_IRQHandler
    def_irq_handler    DSPI3_Receive_IRQHandler
    def_irq_handler    DSPI3_CMDTCF_IRQHandler
    def_irq_handler    DSPI3_CMDFFF_IRQHandler
    def_irq_handler    DSPI3_SPEF_IRQHandler
    def_irq_handler    DSPI4_FIFO_Error_IRQHandler
    def_irq_handler    DSPI4_EOQF_IRQHandler
    def_irq_handler    DSPI4_Send_IRQHandler
    def_irq_handler    DSPI4_TCF_IRQHandler
    def_irq_handler    DSPI4_Receive_IRQHandler
    def_irq_handler    DSPI4_CMDTCF_IRQHandler
    def_irq_handler    DSPI4_CMDFFF_IRQHandler
    def_irq_handler    DSPI4_SPEF_IRQHandler
    def_irq_handler    DSPI5_FIFO_Error_IRQHandler
    def_irq_handler    DSPI_M0_EOQF_IRQHandler
    def_irq_handler    DSPI5_Send_IRQHandler
    def_irq_handler    DSPI_M0_TCF_IRQHandler
    def_irq_handler    DSPI5_Receive_IRQHandler
    def_irq_handler    DSPI_M0_CMDTCF_IRQHandler
    def_irq_handler    DSPI_M0_CMDFFF_IRQHandler
    def_irq_handler    DSPI_M0_SPEF_IRQHandler
    def_irq_handler    DSPI_M0_DDIF_IRQHandler
    def_irq_handler    DSPI6_FIFO_Error_IRQHandler
    def_irq_handler    DSPI_M1_EOQF_IRQHandler
    def_irq_handler    DSPI6_Send_IRQHandler
    def_irq_handler    DSPI_M1_TCF_IRQHandler
    def_irq_handler    DSPI6_Receive_IRQHandler
    def_irq_handler    DSPI_M1_CMDTCF_IRQHandler
    def_irq_handler    DSPI_M1_CMDFFF_IRQHandler
    def_irq_handler    DSPI_M1_SPEF_IRQHandler
    def_irq_handler    DSPI_M1_DDIF_IRQHandler
    def_irq_handler    LINFLEXD0_RX_IRQHandler
    def_irq_handler    LINFLEXD0_TX_IRQHandler
    def_irq_handler    LINFLEXD0_ERR_IRQHandler
    def_irq_handler    LINFLEXD1_RX_IRQHandler
    def_irq_handler    LINFLEXD1_TX_IRQHandler
    def_irq_handler    LINFLEXD1_ERR_IRQHandler
    def_irq_handler    LINFLEXD2_RX_IRQHandler
    def_irq_handler    LINFLEXD2_TX_IRQHandler
    def_irq_handler    LINFLEXD2_ERR_IRQHandler
    def_irq_handler    LINFLEXD3_RX_IRQHandler
    def_irq_handler    LINFLEXD3_TX_IRQHandler
    def_irq_handler    LINFLEXD3_ERR_IRQHandler
    def_irq_handler    LINFLEXD_M0_RX_IRQHandler
    def_irq_handler    LINFLEXD_M0_TX_IRQHandler
    def_irq_handler    LINFLEXD_M0_ERR_IRQHandler
    def_irq_handler    LINFLEXD_M1_RX_IRQHandler
    def_irq_handler    LINFLEXD_M1_TX_IRQHandler
    def_irq_handler    LINFLEXD_M1_ERR_IRQHandler
    def_irq_handler    PMU_IRQHandler
    def_irq_handler    PMU_TSENSE_IRQHandler
    def_irq_handler    PLL_0_0_IRQHandler
    def_irq_handler    PLL_1_0_IRQHandler
    def_irq_handler    PLL_0_1_IRQHandler
    def_irq_handler    PLL_1_1_IRQHandler
    def_irq_handler    FCCU_ALARM_IRQHandler
    def_irq_handler    FCCU_MISC_IRQHandler
    def_irq_handler    FCCU_RCCS0_IRQHandler
    def_irq_handler    FCCU_RCCS1_IRQHandler
    def_irq_handler    STCU2_0_IRQHandler
    def_irq_handler    STCU2_1_IRQHandler
    def_irq_handler    ADC0_EOC_IRQHandler
    def_irq_handler    ADC0_ER_IRQHandler
    def_irq_handler    ADC0_WD_IRQHandler
    def_irq_handler    ADC1_EOC_IRQHandler
    def_irq_handler    ADC1_ER_IRQHandler
    def_irq_handler    ADC1_WD_IRQHandler
    def_irq_handler    ADC2_EOC_IRQHandler
    def_irq_handler    ADC2_ER_IRQHandler
    def_irq_handler    ADC2_WD_IRQHandler
    def_irq_handler    ADC3_EOC_IRQHandler
    def_irq_handler    ADC3_ER_IRQHandler
    def_irq_handler    ADC3_WD_IRQHandler
    def_irq_handler    SDADC0_IRQHandler
    def_irq_handler    SDADC1_IRQHandler
    def_irq_handler    SDADC2_IRQHandler
    def_irq_handler    SENT0_Fast_IRQHandler
    def_irq_handler    SENT0_Slow_IRQHandler
    def_irq_handler    SENT0_RxErr_IRQHandler
    def_irq_handler    SENT1_Fast_IRQHandler
    def_irq_handler    SENT1_Slow_IRQHandler
    def_irq_handler    SENT1_RxErr_IRQHandler
    def_irq_handler    SENT0_Fast_0_IRQHandler
    def_irq_handler    SENT0_Slow_0_IRQHandler
    def_irq_handler    SENT0_RxErr_0_IRQHandler
    def_irq_handler    SENT0_Fast_1_IRQHandler
    def_irq_handler    SENT0_Slow_1_IRQHandler
    def_irq_handler    SENT0_RxErr_1_IRQHandler
    def_irq_handler    SENT0_Fast_2_IRQHandler
    def_irq_handler    SENT0_Slow_2_IRQHandler
    def_irq_handler    SENT0_RxErr_2_IRQHandler
    def_irq_handler    SENT1_Fast_0_IRQHandler
    def_irq_handler    SENT1_Slow_0_IRQHandler
    def_irq_handler    SENT1_RxErr_0_IRQHandler
    def_irq_handler    SENT1_Fast_1_IRQHandler
    def_irq_handler    SENT1_Slow_1_IRQHandler
    def_irq_handler    SENT1_RxErr_1_IRQHandler
    def_irq_handler    SENT1_Fast_2_IRQHandler
    def_irq_handler    SENT1_Slow_2_IRQHandler
    def_irq_handler    SENT1_RxErr_2_IRQHandler
    def_irq_handler    SIPI0_ErrorIrqHandler
    def_irq_handler    SIPI0_CrcErrorIrqHandler
    def_irq_handler    SIPI0_Ch0ResponseOrAckIrqHandler
    def_irq_handler    SIPI0_Ch1ResponseOrAckIrqHandler
    def_irq_handler    SIPI0_Ch2ResponseOrAckIrqHandler
    def_irq_handler    SIPI0_Ch3ResponseOrAckIrqHandler
    def_irq_handler    SIPI0_TriggerOrMaxCountReachedIrqHandler
    def_irq_handler    LFAST0_0_IRQHandler
    def_irq_handler    LFAST0_1_IRQHandler
    def_irq_handler    LFAST0_2_IRQHandler
    def_irq_handler    LFAST0_3_IRQHandler
    def_irq_handler    LFAST0_4_IRQHandler
    def_irq_handler    JTAGM_IRQHandler
    def_irq_handler    JDC_IRQHandler
    def_irq_handler    CAN0_0_IRQHandler
    def_irq_handler    CAN0_1_IRQHandler
    def_irq_handler    CAN0_5_IRQHandler
    def_irq_handler    CAN0_2_IRQHandler
    def_irq_handler    CAN0_3_IRQHandler
    def_irq_handler    CAN0_4_IRQHandler
    def_irq_handler    CAN1_0_IRQHandler
    def_irq_handler    CAN1_1_IRQHandler
    def_irq_handler    CAN1_5_IRQHandler
    def_irq_handler    CAN1_2_IRQHandler
    def_irq_handler    CAN1_3_IRQHandler
    def_irq_handler    CAN1_4_IRQHandler
    def_irq_handler    CAN2_0_IRQHandler
    def_irq_handler    CAN2_1_IRQHandler
    def_irq_handler    CAN2_5_IRQHandler
    def_irq_handler    CAN2_2_IRQHandler
    def_irq_handler    CAN2_3_IRQHandler
    def_irq_handler    CAN2_4_IRQHandler
    def_irq_handler    CAN3_0_IRQHandler
    def_irq_handler    CAN3_1_IRQHandler
    def_irq_handler    CAN3_5_IRQHandler
    def_irq_handler    CAN3_2_IRQHandler
    def_irq_handler    CAN3_3_IRQHandler
    def_irq_handler    CAN3_4_IRQHandler
    def_irq_handler    EMIOS0_8_IRQHandler
    def_irq_handler    EMIOS0_9_IRQHandler
    def_irq_handler    EMIOS0_10_IRQHandler
    def_irq_handler    EMIOS0_11_IRQHandler
    def_irq_handler    EMIOS0_12_IRQHandler
    def_irq_handler    EMIOS0_13_IRQHandler
    def_irq_handler    EMIOS0_14_IRQHandler
    def_irq_handler    EMIOS0_15_IRQHandler
    def_irq_handler    EMIOS0_16_IRQHandler
    def_irq_handler    EMIOS0_17_IRQHandler
    def_irq_handler    EMIOS0_18_IRQHandler
    def_irq_handler    EMIOS0_19_IRQHandler
    def_irq_handler    EMIOS0_20_IRQHandler
    def_irq_handler    EMIOS0_21_IRQHandler
    def_irq_handler    EMIOS0_22_IRQHandler
    def_irq_handler    EMIOS0_23_IRQHandler
    def_irq_handler    EMIOS1_8_IRQHandler
    def_irq_handler    EMIOS1_9_IRQHandler
    def_irq_handler    EMIOS1_10_IRQHandler
    def_irq_handler    EMIOS1_11_IRQHandler
    def_irq_handler    EMIOS1_12_IRQHandler
    def_irq_handler    EMIOS1_13_IRQHandler
    def_irq_handler    EMIOS1_14_IRQHandler
    def_irq_handler    EMIOS1_15_IRQHandler
    def_irq_handler    EMIOS1_16_IRQHandler
    def_irq_handler    EMIOS1_17_IRQHandler
    def_irq_handler    EMIOS1_18_IRQHandler
    def_irq_handler    EMIOS1_19_IRQHandler
    def_irq_handler    EMIOS1_20_IRQHandler
    def_irq_handler    EMIOS1_21_IRQHandler
    def_irq_handler    EMIOS1_22_IRQHandler
    def_irq_handler    EMIOS1_23_IRQHandler
    def_irq_handler    ETPU_GE_IRQHandler
    def_irq_handler    ETPU0_CIS0_IRQHandler
    def_irq_handler    ETPU0_CIS1_IRQHandler
    def_irq_handler    ETPU0_CIS2_IRQHandler
    def_irq_handler    ETPU0_CIS3_IRQHandler
    def_irq_handler    ETPU0_CIS4_IRQHandler
    def_irq_handler    ETPU0_CIS5_IRQHandler
    def_irq_handler    ETPU0_CIS6_IRQHandler
    def_irq_handler    ETPU0_CIS7_IRQHandler
    def_irq_handler    ETPU0_CIS8_IRQHandler
    def_irq_handler    ETPU0_CIS9_IRQHandler
    def_irq_handler    ETPU0_CIS10_IRQHandler
    def_irq_handler    ETPU0_CIS11_IRQHandler
    def_irq_handler    ETPU0_CIS12_IRQHandler
    def_irq_handler    ETPU0_CIS13_IRQHandler
    def_irq_handler    ETPU0_CIS14_IRQHandler
    def_irq_handler    ETPU0_CIS15_IRQHandler
    def_irq_handler    ETPU0_CIS16_IRQHandler
    def_irq_handler    ETPU0_CIS17_IRQHandler
    def_irq_handler    ETPU0_CIS18_IRQHandler
    def_irq_handler    ETPU0_CIS19_IRQHandler
    def_irq_handler    ETPU0_CIS20_IRQHandler
    def_irq_handler    ETPU0_CIS21_IRQHandler
    def_irq_handler    ETPU0_CIS22_IRQHandler
    def_irq_handler    ETPU0_CIS23_IRQHandler
    def_irq_handler    ETPU0_CIS24_IRQHandler
    def_irq_handler    ETPU0_CIS25_IRQHandler
    def_irq_handler    ETPU0_CIS26_IRQHandler
    def_irq_handler    ETPU0_CIS27_IRQHandler
    def_irq_handler    ETPU0_CIS28_IRQHandler
    def_irq_handler    ETPU0_CIS29_IRQHandler
    def_irq_handler    ETPU0_CIS30_IRQHandler
    def_irq_handler    ETPU0_CIS31_IRQHandler
    def_irq_handler    ETPU1_CIS0_IRQHandler
    def_irq_handler    ETPU1_CIS1_IRQHandler
    def_irq_handler    ETPU1_CIS2_IRQHandler
    def_irq_handler    ETPU1_CIS3_IRQHandler
    def_irq_handler    ETPU1_CIS4_IRQHandler
    def_irq_handler    ETPU1_CIS5_IRQHandler
    def_irq_handler    ETPU1_CIS6_IRQHandler
    def_irq_handler    ETPU1_CIS7_IRQHandler
    def_irq_handler    ETPU1_CIS8_IRQHandler
    def_irq_handler    ETPU1_CIS9_IRQHandler
    def_irq_handler    ETPU1_CIS10_IRQHandler
    def_irq_handler    ETPU1_CIS11_IRQHandler
    def_irq_handler    ETPU1_CIS12_IRQHandler
    def_irq_handler    ETPU1_CIS13_IRQHandler
    def_irq_handler    ETPU1_CIS14_IRQHandler
    def_irq_handler    ETPU1_CIS15_IRQHandler
    def_irq_handler    ETPU1_CIS16_IRQHandler
    def_irq_handler    ETPU1_CIS17_IRQHandler
    def_irq_handler    ETPU1_CIS18_IRQHandler
    def_irq_handler    ETPU1_CIS19_IRQHandler
    def_irq_handler    ETPU1_CIS20_IRQHandler
    def_irq_handler    ETPU1_CIS21_IRQHandler
    def_irq_handler    ETPU1_CIS22_IRQHandler
    def_irq_handler    ETPU1_CIS23_IRQHandler
    def_irq_handler    ETPU1_CIS24_IRQHandler
    def_irq_handler    ETPU1_CIS25_IRQHandler
    def_irq_handler    ETPU1_CIS26_IRQHandler
    def_irq_handler    ETPU1_CIS27_IRQHandler
    def_irq_handler    ETPU1_CIS28_IRQHandler
    def_irq_handler    ETPU1_CIS29_IRQHandler
    def_irq_handler    ETPU1_CIS30_IRQHandler
    def_irq_handler    ETPU1_CIS31_IRQHandler
    def_irq_handler    BCTU0_TRI_IRQHandler
    def_irq_handler    BCTU0_ADC0_IRQHandler
    def_irq_handler    BCTU0_ADC1_IRQHandler
    def_irq_handler    BCTU0_ADC2_IRQHandler
    def_irq_handler    BCTU0_ADC3_IRQHandler
    def_irq_handler    BCTU0_LIST_IRQHandler
    def_irq_handler    REACM_G_IRQHandler
    def_irq_handler    REACM_CH0_IRQHandler
    def_irq_handler    REACM_CH1_IRQHandler
    def_irq_handler    REACM_CH2_IRQHandler
    def_irq_handler    REACM_CH3_IRQHandler
    def_irq_handler    REACM_CH4_IRQHandler
    def_irq_handler    REACM_CH5_IRQHandler
    def_irq_handler    REACM_CH6_IRQHandler
    def_irq_handler    REACM_CH7_IRQHandler
    def_irq_handler    REACM_CH8_IRQHandler
    def_irq_handler    REACM_CH9_IRQHandler
    def_irq_handler    DECFILTER0_IN_IRQHandler
    def_irq_handler    DECFILTER0_OUT_IRQHandler
    def_irq_handler    DECFILTER0_ERR_IRQHandler
    def_irq_handler    DECFILTER1_IN_IRQHandler
    def_irq_handler    DECFILTER1_OUT_IRQHandler
    def_irq_handler    DECFILTER1_ERR_IRQHandler
